IDEA StatiCa Open Model
ConnectionLoadInfo.BeamMapping Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 BeamMapping
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<BeamLoadsImportMappingData> BeamMapping { get; set; }
Public Property BeamMapping As List(Of BeamLoadsImportMappingData)
	Get
	Set
public:
property List<BeamLoadsImportMappingData^>^ BeamMapping {
	List<BeamLoadsImportMappingData^>^ get ();
	void set (List<BeamLoadsImportMappingData^>^ value);
}
Property Value
Type: List<BeamLoadsImportMappingData>
See Also
Reference
ConnectionLoadInfo Class
IdeaRS.OpenModel.Connection Namespace